Revit 2026 API

# RenderingQualitySettings Methods

---

The RenderingQualitySettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCustomQuality | Checks if the current rendering quality is custom or not. |
|  | IsValidRenderLevel | Validate the render level is between 1 and 40 |
|  | IsValidRenderTime | Validate the render time is between 1 and 32768. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

RenderingQualitySettings Class

Autodesk.Revit.DB Namespace